# Series

The first main data type we will learn about for pandas is the Series data type. Let's import Pandas and explore the Series object.

A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

Let's explore this concept through some examples:

## DataFrame VS Series

There are no major differences between Pandas Series and a single column dataframe except

1. The Column Name or Header

2. Series does not have any name/header where as the dataframe has column names.

3. The pandas functions related to Data Frame can be used for the dataframe column and the pandas functions related to Series can be used for the series.

4. There are many functions which can be used for both Series and Data Frames, however not all functions can be used interchangeably.

In [3]:
import numpy as np
import pandas as pd

### Creating a Series

You can convert a list,numpy array, or dictionary to a Series:

In [13]:
sky = ['Q','X','Z']
my_list = [10,20,30]
arr = np.array([100,200,300])
d = {'a':10,'b':20,'c':30}
labels=[sky,my_list,arr,d]
labels

[['Q', 'X', 'Z'],
 [10, 20, 30],
 array([100, 200, 300]),
 {'a': 10, 'b': 20, 'c': 30}]

** Using Lists**

In [10]:
print(pd.Series(data=labels))
print()
pd.DataFrame(data=labels)

0                      [Q, X, Z]
1                   [10, 20, 30]
2                [100, 200, 300]
3    {'a': 10, 'b': 20, 'c': 30}
dtype: object

     0    1    2
0    Q    X    Z
1   10   20   30
2  100  200  300
3    a    b    c

In [21]:
print(sky)
print(pd.Series(arr,sky))
pd.Series(data=arr,index=sky)

['Q', 'X', 'Z']
Q    100
X    200
Z    300
dtype: int64

Q    100
X    200
Z    300
dtype: int64

In [16]:
print(pd.Series(sky,arr))
print()
pd.Series(sky,my_list)

100    Q
200    X
300    Z
dtype: object

10    Q
20    X
30    Z
dtype: object

** NumPy Arrays **

In [17]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [24]:
pd.Series(arr,sky)
print(d)

{'a': 10, 'b': 20, 'c': 30}

** Dictionary**

In [16]:
pd.Series(d)
pd.Series(d1)

a    10
b    20
c    30
dtype: int64

In [14]:
d1={"Name":["John","Joseph","Sunny","Honey"],"Age":[27,28,29,45],"Salary":[100,150,200,250]}
d1
pd.DataFrame(d1)

     Name  Age  Salary
0    John   27     100
1  Joseph   28     150
2   Sunny   29     200
3   Honey   45     250

In [17]:
pd.Series(d1)

Name      [John, Joseph, Sunny, Honey]
Age                   [27, 28, 29, 45]
Salary            [100, 150, 200, 250]
dtype: object

In [18]:
labels

[['Q', 'X', 'Z'],
 [10, 20, 30],
 array([100, 200, 300]),
 {'a': 10, 'b': 20, 'c': 30}]

### Data in a Series

A pandas Series can hold a variety of object types:

## Using an Index

The key to using a Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information (works like a hash table or dictionary).

Let's see some examples of how to grab information from a Series. Let us create two sereis, ser1 and ser2:

In [33]:
ser1 = pd.Series([1,2,3,4],index = ['USA', 'Germany','Italy', 'Japan'])
ser1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [36]:
ser2 = pd.Series([1,2,5,4],index = ['USA', 'Germany','Italy', 'Japan'])                                   
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [37]:
ser2.rename(index={"USA":"IND","Germany":"Argentina"},inplace=True)
ser2

IND          1
Argentina    2
Italy        5
Japan        4
dtype: int64

In [39]:
#print(ser2['IND'])
print(ser2)
ser1.rename({"USA":"IND"},inplace=True)
ser1

IND          1
Argentina    2
Italy        5
Japan        4
dtype: int64

IND        1
Germany    2
Italy      3
Japan      4
dtype: int64

Operations are then also done based off of index:

In [40]:
x=ser1 * ser2
x

Argentina     NaN
Germany       NaN
IND           1.0
Italy        15.0
Japan        16.0
dtype: float64

# Great Job!